driver-tests/bpelse/assign/AssignJbi/test/CopygYearMonthInvoke/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:DataType">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
   <gYearMonthPart>
	<xsd_gYearMonth>2005-8</xsd_gYearMonth>
	<optional_gYearMonth>2006-1</optional_gYearMonth>
	<repeat_gYearMonth>2006-1</repeat_gYearMonth>
	<repeat_gYearMonth>2006-10</repeat_gYearMonth>
   </gYearMonthPart>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
